results/r5-b_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 5427.66 qps: 32584.11 (r/w/o: 0.00/21723.54/10860.57) lat (ms,95%): 15.55 err/s: 2.05 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5760.33 qps: 34563.10 (r/w/o: 0.00/23040.58/11522.52) lat (ms,95%): 13.70 err/s: 1.85 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5949.93 qps: 35710.03 (r/w/o: 0.00/23808.32/11901.71) lat (ms,95%): 13.95 err/s: 1.85 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5962.98 qps: 35779.21 (r/w/o: 0.00/23850.56/11928.65) lat (ms,95%): 13.95 err/s: 2.75 reconn/s: 0.00
[ 100s ] thds: 64 tps: 6012.22 qps: 36085.99 (r/w/o: 0.00/24059.44/12026.55) lat (ms,95%): 13.46 err/s: 2.05 reconn/s: 0.00
[ 120s ] thds: 64 tps: 6057.22 qps: 36351.69 (r/w/o: 0.00/24235.09/12116.60) lat (ms,95%): 13.46 err/s: 2.15 reconn/s: 0.00
[ 140s ] thds: 64 tps: 6131.00 qps: 36793.66 (r/w/o: 0.00/24529.11/12264.55) lat (ms,95%): 13.22 err/s: 2.55 reconn/s: 0.00
[ 160s ] thds: 64 tps: 6101.71 qps: 36611.43 (r/w/o: 0.00/24405.97/12205.46) lat (ms,95%): 13.46 err/s: 2.05 reconn/s: 0.00
[ 180s ] thds: 64 tps: 6119.87 qps: 36721.94 (r/w/o: 0.00/24480.36/12241.58) lat (ms,95%): 13.46 err/s: 1.85 reconn/s: 0.00
[ 200s ] thds: 64 tps: 6164.98 qps: 37001.97 (r/w/o: 0.00/24670.36/12331.61) lat (ms,95%): 13.22 err/s: 1.65 reconn/s: 0.00
[ 220s ] thds: 64 tps: 6150.30 qps: 36907.78 (r/w/o: 0.00/24605.09/12302.69) lat (ms,95%): 13.46 err/s: 2.10 reconn/s: 0.00
[ 240s ] thds: 64 tps: 6133.99 qps: 36802.96 (r/w/o: 0.00/24532.73/12270.24) lat (ms,95%): 13.70 err/s: 2.25 reconn/s: 0.00
[ 260s ] thds: 64 tps: 6101.51 qps: 36623.06 (r/w/o: 0.00/24417.89/12205.17) lat (ms,95%): 13.95 err/s: 2.15 reconn/s: 0.00
[ 280s ] thds: 64 tps: 6117.95 qps: 36715.94 (r/w/o: 0.00/24477.25/12238.70) lat (ms,95%): 13.70 err/s: 2.80 reconn/s: 0.00
[ 300s ] thds: 64 tps: 6113.00 qps: 36684.74 (r/w/o: 0.00/24456.45/12228.30) lat (ms,95%): 13.95 err/s: 2.30 reconn/s: 0.00
[ 320s ] thds: 64 tps: 6139.54 qps: 36834.78 (r/w/o: 0.00/24553.41/12281.38) lat (ms,95%): 13.70 err/s: 2.35 reconn/s: 0.00
[ 340s ] thds: 64 tps: 6112.51 qps: 36689.93 (r/w/o: 0.00/24462.85/12227.08) lat (ms,95%): 13.95 err/s: 2.00 reconn/s: 0.00
[ 360s ] thds: 64 tps: 6170.80 qps: 37032.09 (r/w/o: 0.00/24687.99/12344.10) lat (ms,95%): 13.46 err/s: 2.50 reconn/s: 0.00
[ 380s ] thds: 64 tps: 6143.11 qps: 36863.66 (r/w/o: 0.00/24575.64/12288.02) lat (ms,95%): 13.46 err/s: 1.80 reconn/s: 0.00
[ 400s ] thds: 64 tps: 6135.78 qps: 36816.19 (r/w/o: 0.00/24541.88/12274.31) lat (ms,95%): 13.46 err/s: 2.75 reconn/s: 0.00
[ 420s ] thds: 64 tps: 6176.86 qps: 37071.82 (r/w/o: 0.00/24716.40/12355.42) lat (ms,95%): 13.22 err/s: 1.70 reconn/s: 0.00
[ 440s ] thds: 64 tps: 6125.63 qps: 36759.19 (r/w/o: 0.00/24505.88/12253.31) lat (ms,95%): 13.70 err/s: 2.05 reconn/s: 0.00
[ 460s ] thds: 64 tps: 6136.57 qps: 36827.40 (r/w/o: 0.00/24551.92/12275.48) lat (ms,95%): 13.70 err/s: 2.35 reconn/s: 0.00
[ 480s ] thds: 64 tps: 6161.50 qps: 36974.93 (r/w/o: 0.00/24649.99/12324.94) lat (ms,95%): 13.70 err/s: 1.95 reconn/s: 0.00
[ 500s ] thds: 64 tps: 6199.92 qps: 37201.49 (r/w/o: 0.00/24799.01/12402.48) lat (ms,95%): 13.46 err/s: 2.65 reconn/s: 0.00
[ 520s ] thds: 64 tps: 6148.26 qps: 36901.74 (r/w/o: 0.00/24602.91/12298.83) lat (ms,95%): 13.70 err/s: 2.30 reconn/s: 0.00
[ 540s ] thds: 64 tps: 6173.02 qps: 37045.12 (r/w/o: 0.00/24696.68/12348.44) lat (ms,95%): 13.70 err/s: 2.40 reconn/s: 0.00
[ 560s ] thds: 64 tps: 6151.00 qps: 36911.70 (r/w/o: 0.00/24607.80/12303.90) lat (ms,95%): 13.70 err/s: 1.90 reconn/s: 0.00
[ 580s ] thds: 64 tps: 6179.10 qps: 37081.09 (r/w/o: 0.00/24720.64/12360.45) lat (ms,95%): 13.70 err/s: 2.25 reconn/s: 0.00
[ 600s ] thds: 64 tps: 6204.31 qps: 37223.51 (r/w/o: 0.00/24813.14/12410.37) lat (ms,95%): 13.46 err/s: 1.75 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           14615760
        other:                           7307948
        total:                           21923708
    transactions:                        3653323 (6088.10 per sec.)
    queries:                             21923708 (36534.90 per sec.)
    ignored errors:                      1302   (2.17 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0746s
    total number of events:              3653323

Latency (ms):
         min:                                    3.41
         avg:                                   10.51
         max:                                   49.67
         95th percentile:                       13.70
         sum:                             38391733.72

Threads fairness:
    events (avg/stddev):           57083.1719/112.06
    execution time (avg/stddev):   599.8708/0.01