results/r5-b_write_8.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 8 tps: 1540.00 qps: 9241.08 (r/w/o: 0.00/6160.63/3080.44) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1520.41 qps: 9123.33 (r/w/o: 0.00/6082.52/3040.81) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1536.30 qps: 9217.89 (r/w/o: 0.00/6145.24/3072.65) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1529.45 qps: 9176.65 (r/w/o: 0.00/6117.75/3058.90) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1523.35 qps: 9140.50 (r/w/o: 0.00/6093.75/3046.75) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1535.15 qps: 9210.99 (r/w/o: 0.00/6140.65/3070.35) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 140s ] thds: 8 tps: 1531.70 qps: 9190.25 (r/w/o: 0.00/6126.80/3063.45) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 160s ] thds: 8 tps: 1543.30 qps: 9257.92 (r/w/o: 0.00/6171.71/3086.21) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 8 tps: 1540.35 qps: 9244.38 (r/w/o: 0.00/6163.19/3081.19) lat (ms,95%): 6.43 err/s: 0.10 reconn/s: 0.00
[ 200s ] thds: 8 tps: 1527.40 qps: 9162.42 (r/w/o: 0.00/6108.01/3054.41) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 8 tps: 1527.30 qps: 9165.78 (r/w/o: 0.00/6110.79/3054.99) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 8 tps: 1550.00 qps: 9300.00 (r/w/o: 0.00/6200.00/3100.00) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 8 tps: 1540.75 qps: 9243.71 (r/w/o: 0.00/6162.21/3081.50) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 8 tps: 1504.55 qps: 9028.39 (r/w/o: 0.00/6019.19/3009.20) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
[ 300s ] thds: 8 tps: 1520.30 qps: 9121.82 (r/w/o: 0.00/6081.21/3040.61) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 8 tps: 1511.20 qps: 9067.18 (r/w/o: 0.00/6044.79/3022.39) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 8 tps: 1505.75 qps: 9033.86 (r/w/o: 0.00/6022.31/3011.55) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
[ 360s ] thds: 8 tps: 1495.40 qps: 8973.18 (r/w/o: 0.00/5982.39/2990.79) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 8 tps: 1492.40 qps: 8954.55 (r/w/o: 0.00/5969.70/2984.85) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
[ 400s ] thds: 8 tps: 1509.60 qps: 9057.75 (r/w/o: 0.00/6038.50/3019.25) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 420s ] thds: 8 tps: 1507.05 qps: 9041.50 (r/w/o: 0.00/6027.40/3014.10) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 8 tps: 1513.45 qps: 9081.65 (r/w/o: 0.00/6054.70/3026.95) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 460s ] thds: 8 tps: 1506.95 qps: 9041.70 (r/w/o: 0.00/6027.80/3013.90) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 8 tps: 1513.30 qps: 9078.90 (r/w/o: 0.00/6052.20/3026.70) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
[ 500s ] thds: 8 tps: 1498.10 qps: 8988.36 (r/w/o: 0.00/5992.11/2996.25) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
[ 520s ] thds: 8 tps: 1499.50 qps: 8997.94 (r/w/o: 0.00/5998.89/2999.05) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 540s ] thds: 8 tps: 1513.80 qps: 9084.55 (r/w/o: 0.00/6056.60/3027.95) lat (ms,95%): 6.55 err/s: 0.35 reconn/s: 0.00
[ 560s ] thds: 8 tps: 1507.45 qps: 9044.95 (r/w/o: 0.00/6030.00/3014.95) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 580s ] thds: 8 tps: 1503.50 qps: 9020.99 (r/w/o: 0.00/6014.00/3007.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 8 tps: 1500.15 qps: 9001.05 (r/w/o: 0.00/6000.70/3000.35) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3643923
        other:                           1821962
        total:                           5465885
    transactions:                        910968 (1518.25 per sec.)
    queries:                             5465885 (9109.63 per sec.)
    ignored errors:                      26     (0.04 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0102s
    total number of events:              910968

Latency (ms):
         min:                                    3.00
         avg:                                    5.27
         max:                                   16.09
         95th percentile:                        6.55
         sum:                              4798492.86

Threads fairness:
    events (avg/stddev):           113871.0000/289.49
    execution time (avg/stddev):   599.8116/0.01