results/r5-c_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 5044.64 qps: 30288.86 (r/w/o: 0.00/20194.58/10094.29) lat (ms,95%): 16.41 err/s: 1.80 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5371.28 qps: 32227.73 (r/w/o: 0.00/21483.22/10744.51) lat (ms,95%): 14.21 err/s: 1.95 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5423.42 qps: 32544.53 (r/w/o: 0.00/21697.03/10847.49) lat (ms,95%): 14.46 err/s: 2.10 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5517.21 qps: 33116.94 (r/w/o: 0.00/22078.93/11038.01) lat (ms,95%): 14.46 err/s: 2.15 reconn/s: 0.00
[ 100s ] thds: 64 tps: 5680.60 qps: 34089.46 (r/w/o: 0.00/22726.21/11363.25) lat (ms,95%): 13.70 err/s: 2.05 reconn/s: 0.00
[ 120s ] thds: 64 tps: 5638.95 qps: 33838.04 (r/w/o: 0.00/22558.44/11279.60) lat (ms,95%): 13.95 err/s: 1.70 reconn/s: 0.00
[ 140s ] thds: 64 tps: 5683.30 qps: 34089.84 (r/w/o: 0.00/22724.45/11365.40) lat (ms,95%): 13.95 err/s: 2.00 reconn/s: 0.00
[ 160s ] thds: 64 tps: 5686.85 qps: 34143.72 (r/w/o: 0.00/22764.56/11379.16) lat (ms,95%): 13.95 err/s: 2.25 reconn/s: 0.00
[ 180s ] thds: 64 tps: 5684.11 qps: 34108.54 (r/w/o: 0.00/22738.83/11369.71) lat (ms,95%): 14.21 err/s: 1.50 reconn/s: 0.00
[ 200s ] thds: 64 tps: 5690.84 qps: 34151.41 (r/w/o: 0.00/22767.47/11383.94) lat (ms,95%): 14.21 err/s: 2.25 reconn/s: 0.00
[ 220s ] thds: 64 tps: 5693.05 qps: 34164.00 (r/w/o: 0.00/22775.90/11388.10) lat (ms,95%): 14.21 err/s: 2.00 reconn/s: 0.00
[ 240s ] thds: 64 tps: 5691.30 qps: 34145.42 (r/w/o: 0.00/22760.78/11384.64) lat (ms,95%): 14.21 err/s: 2.05 reconn/s: 0.00
[ 260s ] thds: 64 tps: 5710.08 qps: 34274.47 (r/w/o: 0.00/22852.36/11422.11) lat (ms,95%): 13.95 err/s: 1.95 reconn/s: 0.00
[ 280s ] thds: 64 tps: 5748.78 qps: 34499.46 (r/w/o: 0.00/22999.55/11499.90) lat (ms,95%): 13.95 err/s: 2.35 reconn/s: 0.00
[ 300s ] thds: 64 tps: 5739.09 qps: 34429.31 (r/w/o: 0.00/22949.39/11479.92) lat (ms,95%): 13.95 err/s: 1.75 reconn/s: 0.00
[ 320s ] thds: 64 tps: 5730.00 qps: 34383.98 (r/w/o: 0.00/22921.99/11461.99) lat (ms,95%): 14.21 err/s: 2.10 reconn/s: 0.00
[ 340s ] thds: 64 tps: 5726.26 qps: 34375.10 (r/w/o: 0.00/22920.59/11454.52) lat (ms,95%): 13.95 err/s: 1.90 reconn/s: 0.00
[ 360s ] thds: 64 tps: 5697.86 qps: 34193.45 (r/w/o: 0.00/22795.58/11397.87) lat (ms,95%): 14.21 err/s: 2.15 reconn/s: 0.00
[ 380s ] thds: 64 tps: 5734.55 qps: 34414.55 (r/w/o: 0.00/22942.95/11471.60) lat (ms,95%): 13.70 err/s: 2.50 reconn/s: 0.00
[ 400s ] thds: 64 tps: 5769.78 qps: 34623.66 (r/w/o: 0.00/23082.30/11541.35) lat (ms,95%): 13.95 err/s: 1.80 reconn/s: 0.00
[ 420s ] thds: 64 tps: 5723.42 qps: 34344.14 (r/w/o: 0.00/22896.05/11448.10) lat (ms,95%): 14.21 err/s: 1.25 reconn/s: 0.00
[ 440s ] thds: 64 tps: 5743.75 qps: 34467.45 (r/w/o: 0.00/22978.20/11489.25) lat (ms,95%): 14.21 err/s: 1.75 reconn/s: 0.00
[ 460s ] thds: 64 tps: 5808.76 qps: 34859.07 (r/w/o: 0.00/23239.34/11619.72) lat (ms,95%): 13.95 err/s: 2.20 reconn/s: 0.00
[ 480s ] thds: 64 tps: 5737.02 qps: 34415.11 (r/w/o: 0.00/22940.37/11474.74) lat (ms,95%): 14.21 err/s: 2.05 reconn/s: 0.00
[ 500s ] thds: 64 tps: 5787.67 qps: 34740.44 (r/w/o: 0.00/23161.64/11578.80) lat (ms,95%): 13.95 err/s: 2.10 reconn/s: 0.00
[ 520s ] thds: 64 tps: 5732.45 qps: 34403.58 (r/w/o: 0.00/22937.14/11466.44) lat (ms,95%): 13.95 err/s: 1.55 reconn/s: 0.00
[ 540s ] thds: 64 tps: 5721.82 qps: 34335.65 (r/w/o: 0.00/22890.32/11445.33) lat (ms,95%): 13.95 err/s: 1.70 reconn/s: 0.00
[ 560s ] thds: 64 tps: 5751.58 qps: 34503.65 (r/w/o: 0.00/22998.70/11504.95) lat (ms,95%): 13.95 err/s: 1.85 reconn/s: 0.00
[ 580s ] thds: 64 tps: 5778.65 qps: 34686.89 (r/w/o: 0.00/23127.44/11559.45) lat (ms,95%): 13.95 err/s: 2.10 reconn/s: 0.00
[ 600s ] thds: 64 tps: 5707.75 qps: 34252.61 (r/w/o: 0.00/22835.66/11416.95) lat (ms,95%): 14.46 err/s: 1.45 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           13614835
        other:                           6807502
        total:                           20422337
    transactions:                        3403168 (5671.28 per sec.)
    queries:                             20422337 (34033.25 per sec.)
    ignored errors:                      1166   (1.94 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0688s
    total number of events:              3403168

Latency (ms):
         min:                                    3.82
         avg:                                   11.28
         max:                                   57.18
         95th percentile:                       14.21
         sum:                             38396500.75

Threads fairness:
    events (avg/stddev):           53174.5000/87.27
    execution time (avg/stddev):   599.9453/0.01